"""

decoding tail use huffman lookup
"""
from bitarray import bitarray
from bitarray.util import ba2int
from vdo.block_basegeo import bitstream
from vdo.datatypes import LIST
from vdo.consts import BITS_IN_ASCII, struct_BYTE, LOOKUP_CHARS

# flake8 E501  10100011000 10100110000
"""
INPUT_STR = bitarray('10100011000101001100000000110000010000110000010000110000010000110000010000110000010000110000011111101101011101000101101111111000111001110110101111000001001010011110001010100011001001111010111011100110000111101101101110110001011100001011000000100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000011010001100010001010110000000000010100001101010000110101000100010100010101010001100000000000000000000000000000000')   # noqa
"""

# penzhinskaya guba    zaliv shelikhova    okhotskoe more
# 000: > a+eaeaeCNadE  aai;hak##dia+larartszhig#k!%"penzh#k!%"zaliv sheli$va#o$tskoe more#araaeaaaa (591 -> 91)
# 032: > egas#dra aai;hak##dia+larartszhi@#k!%"penzh#k!%"zaliv sheli$va#o$tskoe more#araaeaaaaaaaaa (559 -> 76) # noqa
# $ - kho
INPUT_STR_515 = bitarray('1000110000001001000001000001111000011111001110000100011110001011000010000000000111101001110111011100110001111010111101000110111100011010000011001111110101000011000001100101010011111101010011101001001011010001111110101111010000111010010111010001011111000000110110111111010100111101000111111010111101000011101001011101000101111110100001010110100111110110100000100100110011010110100110100100111110110000011110111110100100010101001111010111011100110000111101101101110110001011100001100000000010000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000')   # noqa

# # =mal. lyakhovskiy|bol. lyakhovskiy|kotel'niy|more laptevykh|vostochno sibirskoe more
# guba gusinaya
# 127: > bol. lyakhovsk#nov!$"'#kotel'n#@uba @usin!#vostochno$"skoe more#araasaaaaaaaaaaaaaaaaaaaaa (590 -> 110) # noqa
INPUT_STR_526 = bitarray('1010101111001011000010110001111000011111001110000100011110001011010011110010000111101001111100100000000001101000001110011110100100001100000100001100000111110001010111101011101011101000010101111111001000111101011100111011111111011001001111010111101000111011010111111110110110100001110100100110100010110100111011111110101110111010100110101110100111101101101000111001011111010111110001000010000100101111101010100101001011011010000101111111101101011101000101101111111000111001110110101111101001001101000100100111101011101110011000011110110110111011000101110000110000000010000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000110101011110010001010110000011010110011010011010110110110000011010111001010011010111100110010101010010101010101001010101011010101011000101010110101010101110010101011110000000000000000000000000000000000000')   # noqa

# 000: > a+a+a+a+a+a+m#stochno sibirskoe more#at eaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa#adt (468 -> 92)
# 070: > {t"?d+lAesbirskoe more#at eaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa#adt aatarieladstt (398 -> 37)
# 071: > vostochno sibirskoe more#at eaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa#adt aatarielads (397 -> 45)
# 072: > m#stochno sibirskoe more#at eaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa#adt aatarielads (396 -> 45)
INPUT_STR_54f = bitarray('10100011000101001100000000110000010000110000010000110000010000110000010000110000010000110000011111101101011101000101101111111000111001110110101111000001001010011110001010100011001001111010111011100110000111101101101110110001011100001011000000100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000011010001100010001010110000000000010100001101010000110101000100010100010101010001100000000000000000000000000000000')   # noqa


lookup_chars = {'000': 'a',   # b'\x00',       # ??????  00? @ -> a E#l. ly@khovsk
                '001': 'e',
                '0100': 's',
                '0101': 't',
                '0110': 'r',
                '0111': '\x00',   # '\x00',     # 01 ???????????? Сюда идеально встает буква a. UPD: а вообще похоже 00
                '10000': ' ',
                '10001': 'd',    # 02 ???????????? Сюда подходят буквы o и l (или d).
                '10010': 'g',    # 03 ???????????? Однако, по условию буква o в конце
                '10011': 'h',
                '10100': 'i',
                '10101': 'l',    # 04 ???????????? заполняется буквой c или u (с загружалась через 11, u -koteu'n)
                '10110': 'n',
                '10111': 'o'
}
# #vostochno$"skoe more#   $" -> ' sibir'?
# 127: > bol. lyakhovsk#nov!$"'#kotel'n#@uba @usin!#vostochno$"skoe more#araasaaaaaaaaaaaaaaaaaaaaa (590 -> 110)
# =mal. lyakhovskiy|bol. lyakhovskiy|kotel'niy|more laptevykh|vostochno sibirskoe more

# $ -> kh???

def decode_ascii_code() -> int:
    """
    декодирует значение символа из битового потока
    Returns:
        int: числовое значение uchar

    v       o     s    t    o       c       H    N      o    ' '    s    i      b        i    r    s      k        o    e
111110110 10111 0100 0101 10111 111100011 10011 10110 10111 10000 0100 10100 111100010 10100 0110 0100 111101011 10111 001


    """
    global INPUT_STR
    prefix = INPUT_STR[:2]
    INPUT_STR = INPUT_STR[2:]
    if prefix.to01() == '11':
        # just load
        val = ba2int(INPUT_STR[:7])
        INPUT_STR = INPUT_STR[7:]
        return val
    #
    if prefix.to01() == '00':
        #
        prefix += INPUT_STR[:1]
        INPUT_STR = INPUT_STR[1:]
    elif prefix.to01() == '01':
        #
        prefix += INPUT_STR[:2]
        INPUT_STR = INPUT_STR[2:]
    else:   # elif prefix.to01() == '10':
        #
        prefix += INPUT_STR[:3]
        INPUT_STR = INPUT_STR[3:]
    val = lookup[prefix.to01()]
    val = ord(val)
    return val

# 071515
# 071526    mal. lyakhovskiy|bol. lyakhovskiy|kotel'niy|more laptevykh|vostochno sibirskoe more


class be_bitstream(bitstream):
    """
    для дебага-отладки по-быстрому
    """
    def __init__(self, ba: bytearray, max_ptr_bits: int) -> None:
        super().__init__(ba, 0x00, max_ptr_bits, 0x100, LIST(b'\x00\x01\x02\x03'))

    def unpack_str(self) -> bytes:
        """
        Распаковывает строку
        Returns:
            bin_str: бинарное представление строковой части zero-ended строк 
        """
        # первыми 2 ptr - начало и окончание строки
        ptr_start = int(self._unpack_ptr(), 16)
        ptr_end = int(self._unpack_ptr(), 16)
        strings_length = ptr_end - ptr_start
        del ptr_end
        del ptr_start
        
        # self.res на этом месте - 4 байта
        # clear. вааобще то сюда tstr надо, которые еще не распаковывались) # noqa 
        self.result.clear()

        # далее - подготовка преамбулы для хаффмановского декодирования
        # преамбула - словарь из 6 элементов с ключами от 110100001 до 110100110
        # но 11 это преамбула, поэтому от 0100001 до 0100110
        preambula = {}
        for k in range(0b0100001, 0b0100111):
            #print(f"{k:b}")
            # первые 3 бита = 000
            if beg_marker := ba2int(self._pop(3)):             # val.to01() != '000':
                raise ValueError(f"WTF? В начале строк преамбулы ожидалось 000, а не '{beg_marker:3b}'")    # noqa
            del beg_marker

            # затем 2 бита - количество ascii chars для чтения
            if not (n := ba2int(self._pop(2))):         #  11 и 01 точно да, а остальные варианты - хз.  # noqa
                # Вроде 00 не может быть - иначе зачем 6 шт где не кодируется ничего?
                raise ValueError(f"WTF? В количестве ch преамбулы не ожидалось 00, а тут '{n:2b}'")    # noqa
            #теперь загрузить n chars
            val = ''
            for _ in range(n):
                # и грузятся ascii коды по 7 бит
                ch = chr(ba2int(self._pop(BITS_IN_ASCII)))
                val += ch
                # ba = self._pop(BITS_IN_ASCII)
                # bi = ba2int(ba)
                # bb = ba.tobytes()
                # bch = struct_BYTE.unpack(bb)[0]
                # print(bch)
                # #ch_code = ba2int()
                # ch = chr(bi)
                # # bch = struct_BYTE.pack(ch_code)
                # val += ch
                pass
            preambula[f"{k:07b}"] = val

        # и вот только теперь пошли буквы, закодированные ....эммм.
        # .. хафманом, но с нюансами
        res = ''
        for _ in range(strings_length):
            prefix = self._pop(2)
            if prefix.to01() == '11':
                ba = self._pop(BITS_IN_ASCII)
                if ba.to01() in preambula:
                    # о, сокращённенькое из преамбулы
                    pre_chars = preambula[ba.to01()]
                    # но если из преамбулы возвращается А
                    if pre_chars == 'A':
                        res += chr(ba2int(ba))
                    else:
                        res += pre_chars
                else:
                    # или ascii код буквы
                    res += chr(ba2int(ba))
                continue        # всё, данные итерации загружены
            elif prefix.to01() == '00':
                prefix += self._pop(1)
            elif prefix.to01() == '01':
                prefix += self._pop(2)
            else:       # elif prefix.to01() == '10':
                prefix += self._pop(3)
            # вытаскиваем, что получилось, из дерева и добавляем к результату
            res += LOOKUP_CHARS[prefix.to01()]
        # всё, упакованные буквы окончились

        # подрезать хвосты - по длинне могло подрасти из-за использования преамбулы
        bin_str = res.encode('cp1251')
        bin_str = bin_str[:strings_length]
        # res = bin_str.decode('cp1251')
        return bin_str
    
 
# end class be_bitstream(bitstream):
"""
000 11 1100001 1111001 1100001 'aya'  <- 110100001
000 11 1100010 1100001 0000000 'ba#'  <- 110100010
000 11 1101001 1101110 1110011 'ins'  <- 110100011
000 11 1101011 1101000 1101111 'kho'  <- 110100100
000 11 0100000 1100111 1110101 ' gu'  <- 110100101
000 01 1000001 'A'                    <- 110100110

1001010100111111010100111010010010110100011111101011110100001110100101110100010111110000001101101111110101001111010001111110101111010
"""

INPUT_STR = INPUT_STR_515
bits_in_ptr = 12
INPUT_STR = INPUT_STR_54f
bits_in_ptr = 11
# INPUT_STR = INPUT_STR_526
# bits_in_ptr = 12

if __name__ == "__main__":
    # buffer
    buffer = be_bitstream(INPUT_STR.tobytes(), bits_in_ptr)
    # первые 2 значения - начальный и завершающий оффсет для str
    bin_strings = buffer.unpack_str()
    all_strings = bin_strings.decode('cp1251')
    print(all_strings)

    with open("this_log.log", "bw") as f:
        f.write(bin_strings)
    """
    # noqa

    515
    'gizhiginskaya guba\x00penzhinskaya guba\x00zaliv shelikhova\x00okhotskoe more'

    _526
    "bol. lyakhovskiy\x00novaya sibir'\x00kotel'niy\x00guba gusinaya\x00vostochno sibirskoe more"

    _54f
    'vostochno sibirskoe more'

    """
    pass

"""
# noqa
526
on start bitarray('0001111000011111001110000100011110001011010011110010000111101001111100100000000001101000001110011110100100001100000100001100000111110001010111101011101011101000010101111111001000111101011100111011111111011001001111010111101000111011010111111110110110100001110100100110100010110100111011111110101110111010100110101110100111101101101000111001011111010111110001000010000100101111101010100101001011011010000101111111101101011101000101101111111000111001110110101111101001001101000100100111101011101110011000011110110110111011000101110000110000000010000000000000000000000...')


[127:]  (но в цикле ещё одну первую 1 - в минус)
bitarray('111110001010111101011101011101000010101111111001000111101011100111011111111011001001111010111101000111011010111111110110110100001110100100110100010110100111011111110101110111010100110101110100111101101101000111001011111010111110001000010000100101111101010100101001011011010000101111111101101011101000101101111111000111001110110101111101001001101000100100111101011101110011000011110110110111011000101110000110000000010000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000110101011110010001010110000011010110011010011010110110110000011010111001010011010111100110010101010010101010101001010101011010101011000101010110101010101110010101011110000000000000000000000000000000000000')

bol. -> b loaded

preambula = '00011110000111110011100001000111100010110100111100100001111010011111001000000000011010000011100111101001000011000001000011000001'
            'aya'                             'bir'                   'iy\x00(7bit)'                ' si'
la = '000 11110000111110011100001 000 11110001011010011110010 000 11110100111110010000000 000 11010000011100111101001 \
             A               A
    000 01 1000001 000 01 1000001'
       bol. lyakhovskiy|kotel'niy|more laptevykh|vostochno sibirskoe more|guba gusinaya
127: > bol. lyakhovsk#nov!$"'#kotel'n#guba gusin!#vostochno$"skoe more#araasaaaaaaaaaaaaaaaaaaaaa (812 -> 332)

guba gusin! -> guba gusinaya  !: 100001 | 110100001  -> 'aya' 
    a: 000 or 1100001  y: y:1111001 a: 000 or 1100001
    'aya' = 11110000111110011100001 3ch:aya

bol. lyakhovsk# -> ibol. lyakhovskiy|
kotel'n# -> kotel'niy|
    'iy#' i: 10100 y:1111001  101001111001    '0111': '#'?
    11110100111110010000000 - 3ch: iy\x00(7bit)

vostochno$"skoe -> ' sibir': ' s' 10000 0100 | 100000100  ; 
                             'ibir'= i:10100  b: i:10100 r:0110
                                 i:1101001   b:11 1100010      i:1101001  r: 1110010
                                 'bir' = 11110001011010011110010 11===3? далее 3 ch
$" 
$ = 110100100 -> ' si' (100=4?) 4й в преамбуле
" = 110100010 -> 'bir' (010=2)  2й в преамбуле
! = 110100001 -> 'aya' - 1й и преамбуле
предположение:
110100011 - 'iy#'


===================================
разбор преамбулы 07154f 02  BlockType.MAP__10k400: 0x1d
000011000001000011000001000011000001000011000001000011000001000011000001

         A               A             A              A               A              A
000 01 1000001 000 01 1000001 000 01 1000001 000 01 1000001 000 01 1000001 000 01 1000001

===================================
разбор преамбулы 071515 04  BlockType.MAP__10k400: 0x1d  Max PTR bites: 12
'00011110000111110011100001000111100010110000100000000001111010011101110111001100011110101111010001101111000110100000110011111101010000110000011001010100111111010100111010010010110100011111101011110100001110100101110100010111110000001101101111110101001111010001111110101111010'
6 

000 11 1100001 1111001 1100001 'aya'  <- 110100001
000 11 1100010 1100001 0000000 'ba#'  <- 110100010
000 11 1101001 1101110 1110011 'ins'  <- 110100011
000 11 1101011 1101000 1101111 'kho'  <- 110100100
000 11 0100000 1100111 1110101 ' gu'  <- 110100101
000 01 1000001 'A'                    <- 110100110

1001010100111111010100111010010010110100011111101011110100001110100101110100010111110000001101101111110101001111010001111110101111010


===================================
Max PTR bites: 12

lookup = {'000': 'a',    '001': 'e',  '0100': 's',  '0101': 't',   '0110': 'r',
          '0111': '#',  '10000': ' ', '10001': 'd',  '10010': 'g', '10011': 'h',
          '10100': 'i', '10101': 'l',   '10110': 'n',  '10111': 'o'}

'`':  96|1100000        'a':  97|1100001        'b':  98|1100010        'c':  99|1100011
'd': 100|1100100        'e': 101|1100101        'f': 102|1100110        'g': 103|1100111
'h': 104|1101000        'i': 105|1101001        'j': 106|1101010        'k': 107|1101011
'l': 108|1101100        'm': 109|1101101        'n': 110|1101110        'o': 111|1101111
'p': 112|1110000        'q': 113|1110001        'r': 114|1110010        's': 115|1110011
't': 116|1110100        'u': 117|1110101        'v': 118|1110110        'w': 119|1110111
'x': 120|1111000        'y': 121|1111001        'z': 122|1111010        '{': 123|1111011
'|': 124|1111100        '}': 125|1111101        '~': 126|1111110        '': 127|1111111

' ':  32| 100000        '!':  33| 100001        '"':  34| 100010        '#':  35| 100011
'$':  36| 100100        '%':  37| 100101        '&':  38| 100110        ''':  39| 100111
'(':  40| 101000        ')':  41| 101001        '*':  42| 101010        '+':  43| 101011
',':  44| 101100        '-':  45| 101101        '.':  46| 101110        '/':  47| 101111
'0':  48| 110000        '1':  49| 110001        '2':  50| 110010        '3':  51| 110011
'4':  52| 110100        '5':  53| 110101        '6':  54| 110110        '7':  55| 110111
'8':  56| 111000        '9':  57| 111001        ':':  58| 111010        ';':  59| 111011
'<':  60| 111100        '=':  61| 111101        '>':  62| 111110        '?':  63| 111111
'@':  64|1000000        'A':  65|1000001        'B':  66|1000010        'C':  67|1000011
'D':  68|1000100        'E':  69|1000101        'F':  70|1000110        'G':  71|1000111
'H':  72|1001000        'I':  73|1001001        'J':  74|1001010        'K':  75|1001011
'L':  76|1001100        'M':  77|1001101        'N':  78|1001110        'O':  79|1001111
'P':  80|1010000        'Q':  81|1010001        'R':  82|1010010        'S':  83|1010011
'T':  84|1010100        'U':  85|1010101        'V':  86|1010110        'W':  87|1010111
'X':  88|1011000        'Y':  89|1011001        'Z':  90|1011010        '[':  91|1011011
'\':  92|1011100        ']':  93|1011101        '^':  94|1011110        '_':  95|1011111


------------------------
print(f"{_:03}: {phrase} ({beg_len} -> {len(INPUT_STR)})")
'000':  '@',          # ??????  00?
'0111': '#',    # b'\x00',
...
068: > evostochno sibirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@d (400 -> 49)
069: > #ZQr|#e5Aesbirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@dst (399 -> 41)
070: > {t"?d|uAesbirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@dstt (398 -> 37)
071: > vostochno sibirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@ds (397 -> 45)
072: > m#stochno sibirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@ds (396 -> 45)
073: > ZQr|#e5Aesbirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@dstt (395 -> 37)
074: > 5"?d|uAesbirskoe more#@t e@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#@dt @@t@rieu@dstt@ (394 -> 34)
...
526

057: > ir@@@ Os |@|E#u. uy@khovsk#nov!$"'#koteu'n#lub@ lusin!#vostochno$"skoe more#@r@@s@@@@@@@@@ (660 -> 146)
058: > sr@@@ Os |@|E#u. uy@khovsk#nov!$"'#koteu'n#lub@ lusin!#vostochno$"skoe more#@r@@s@@@@@@@@@ (659 -> 146)
059: > hH@@r #eR@|@|E#u. uy@khovsk#nov!$"'#koteu'n#lub@ lusin!#vostochno$"skoe more#@r@@s@@@@@@@@ (658 -> 149)
060: > ed@@ei@Os |@|E#u. uy@khovsk#nov!$"'#koteu'n#lub@ lusin!#vostochno$"skoe more#@r@@s@@@@@@@@ (657 -> 149)
kotel'niy
127: > bol. lyakhovsk#nov!$"'#kotel'n#@uba @usin!#vostochno$"skoe more#araasaaaaaaaaaaaaaaaaaaaaa (590 -> 110)


"""
